Simplify architecture documentation
